#словник
diction = [
    {"Номер групи": "103", "ПІБ": "Лагода Тимофій Сергійович", "Курс": "2",
     "Предмети та оцінки": {"Програмування": "76", "Англійська": "67"}},
    {"Номер групи": "103", "ПІБ": "Мізерний Іван Володимирович", "Курс": "3",
     "Предмети та оцінки": {"Математика": "78", "Програмування": "80"}},
    {"Номер групи": "102", "ПІБ": "Лєпіхін Гліб Ігорович", "Курс": "3",
     "Предмети та оцінки": {"Українська мова": "97"}},
    {"Номер групи": "102", "ПІБ": "Зякун Владислав Олександрович", "Курс": "2",
     "Предмети та оцінки": {"Англійська": "69", "Чисельні методи": "79", "Українська мова": "89"}}
]
# Функція додавання студента (Лагода Тимофій)
def addstudent():
    lessons = {}#створення вкладеного словнику для предметів та оцінок
    #заповнення нового елемента словника
    number = input("Введіть номер групи: ")
    pib = input("Введіть ПІБ студента: ")
    course = input("Введіть номер курсу: ")
    k = int(input("Введіть кількість предметів: "))
    for i in range(k):
        lesson = input("Введіть назву предмета: ")
        grade = input("Введіть оцінку: ")
        lessons[lesson] = grade
    new_student = {#створення нового елеметну словника
        "Номер групи": number,
        "ПІБ": pib,
        "Курс": course,
        "Предмети та оцінки": lessons
    }
    diction.append(new_student)
addstudent()